
export const enum Servers {
    Гранас = "Гранас",
    Энигма = "Энигма",
    Логрус = "Логрус"
}
export enum BossTypes {
    Аркон = "Аркон",
    Архон = "Архон",
    Баксбакуалануксивайе = "Баксбакуалануксивайе",
    Воко = "Воко",
    Гигантская_Тортолла = "Гигантская Тортолла",
    Денгур_Кровавый_топор = "Денгур Кровавый топор",
    Деструктор = "Деструктор",
    Древний_Энт = "Древний Энт",
    Зверомор = "Зверомор",
    Королева_Крыс = "Королева Крыс",
    Пружинка = "Пружинка",
    Тёмный_Шаман = "Тёмный Шаман",
    Хьюго = " Хьюго",
    Эдвард = "Эдвард"
}

export enum EliteTypes {
    Альфа_Самец = "Альфа Самец",
    Богатый_Упырь = "Богатый Упырь",
    Жужелица_Тёмная = "Жужелица Тёмная",
    Золотой_Таракан = "Золотой Таракан",
    Кабан_Вожак = "Кабан Вожак",
    Королева_Термитов = "Королева Термитов",
    Королевская_Терния = "Королевская Терния",
    Королевский_Паук = "Королевский Паук",
    Лякуша = "Лякуша",
    Мега_Ирекс = "Мега Ирекс",
    Пещерный_Волк = "Пещерный Волк",
    Пламярык = "Пламярык",
    Превосходный_пожиратель_моземия = "Превосходный пожиратель моземия",
    Превосходный_пожиратель_элениума = "Превосходный пожиратель элениума",
    Самка_Жужа = "Самка Жужа",
    Слепоглаз = "Слепоглаз",
    Советник_Остина = "Советник Остина",
    Тринадцатый_Крыс = "Тринадцатый Крыс",
    Тёмный_Оракул = "Тёмный Оракул",
    Фараон = "Фараон",
    Хозяин = "Хозяин",
    Чёрная_Вдова = "Чёрная Вдова"
}

export const enum Locations {
    Междуречье = "Междуречье",
    Берега_битв = "Берега битв",
    Обиталище_Воко = "Обиталище Воко",
    Трогул = "Трогул",
    Чертог_Кровавого_Топора = "Чертог Кровавого Топора",
    Пустыня_Мара = "Пустыня Мара",
    Каталания = "Каталания",
    Мушрум = "Мушрум",
    Катакомбы_3й_этаж = "Катакомбы 3-й этаж",
    Макдар = "Макдар",
    Элгор = "Элгор",
    Особняк_Кукольника_2й_этаж = "Особняк Кукольника. 2-й этаж.",
    Ворлакс = "Ворлакс",
    Лес_Морры = "Лес Морры",
    Волчьи_Ямы = "Волчьи Ямы",
    Катакомбы_контрабандистов = "Катакомбы контрабандистов",
    Небольшой_склеп_Каталания = "Небольшой склеп (Каталания)",
    Небольшой_склеп_Танцующий_Лес = "Небольшой склеп (Танцующий Лес)",
    Заброшенные_шахты_3й_этаж = "Заброшенные шахты. -3-й этаж",
    Катакомбы_2й_этаж = "Катакомбы 2-й этаж",
    Триозёрье = "Триозёрье",
    Парящая_долина = "Парящая долина",
    Заброшенные_шахты_1й_этаж = "Заброшенные шахты. -1-й этаж",
    Подземелье_паутины = "Подземелье паутины",
    Тадано = "Тадано",
    Большой_Разлом = "Большой Разлом",
    Торговый_путь = "Торговый путь",
    Прииск = "Прииск",
    Адамант = "Адамант",
    Иллаир = "Иллаир",
    Туманган = "Туманган",
    Крокос = "Крокос",
    Поселение_разбойников = "Поселение разбойников",
    Пирамида_2й_этаж = "Пирамида. 2-й этаж",
    Особняк_Кукольника_1й_этаж = "Особняк Кукольника. 1-й этаж.",
    Пещера_Загров = "Пещера Загров"


}
